[
  {
    "title": "Little By Little, Violent Video Games Make Us More Aggressive",
    "content": "Ever since Columbine, in which two students went on a deadly rampage at their high school, television, movies, and video games have been a popular target for senseless acts of violence.",
    "image": "https://api.time.com/wp-content/uploads/2014/03/200131085-001.jpg?quality=85&w=1920",
    "link": "https://time.com/34075/how-violent-video-games-change-kids-attitudes-about-aggression/"
  },
  {
    "title": "'게임은 질병이다?'…인터넷 게임 중독 부작용 속출",
    "content": "The video discusses global concerns over internet game addiction and its potential link to violent behavior, following a mass shooting in New Zealand where the perpetrator broadcast the attack like a video game stream. It highlights rising efforts worldwide—such as bans, treatment programs, and disease classifications—to address gaming addiction and its psychological effects. While video games are portrayed as contributing factors in some extreme cases, the video also reflects a broader international debate on how to manage their impact responsibly.",
    "image": "https://img.youtube.com/vi/WBJkMWaJiNQ/0.jpg",
    "link": "https://www.youtube.com/watch?v=WBJkMWaJiNQ"
  },
  {
    "title": "The devastating effects of video game addiction on children",
    "content": "The video is a deep, emotional exploration of gaming addiction, following the lives of families in crisis due to their children's excessive video game use—particularly Fortnite. It shows how some teens, struggling with anxiety or family issues, turn to games as an escape, only to become isolated, aggressive, and detached from school, friendships, and family life. While it does not vilify video games themselves, the video highlights how powerful and immersive game design—without guidance or limits—can become overwhelming for vulnerable young players, sparking concern about the long-term effects on mental health, development, and family relationships.",
    "image": "https://img.youtube.com/vi/F4soyu2chGY/0.jpg",
    "link": "https://www.youtube.com/watch?v=F4soyu2chGY"
  },
  {
    "title": "Trump wants you to think about video games instead of guns",
    "content": "Washington CNN — Washington tried (and failed) to enact any new gun legislation in the immediate aftermath of the Marjory Stoneman Douglas High School shooting.Having failed at something he promised to get done, President Donald Trump will turn his sights away from real guns and onto the imagined variety, convening a sort of summit at the White House about violence in the media on Thursday.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2212155368-20250512212150262.jpg?c=16x9&q=h_144,w_256,c_fill",
    "link": "https://edition.cnn.com/2018/03/08/politics/trump-video-games-guns/index.html"
  },
  {
    "title": "Are video games linked to real world violence?",
    "content": "The video captures a heated debate hosted after former (now current) President Trump talked about how violent video games contribute to youth violence, following school shootings and rising public concern. Critics argue that games like Call of Duty and Grand Theft Auto desensitize players and train them in simulated killing, while others, like Ben Shapiro, point to data showing youth violence has declined despite rising game use. The majority of the video heavily critiques the potential psychological impact of graphic content, while one of the participants frames the issue as a societal and parental responsibility rather than a matter for government regulation.",
    "image": "https://img.youtube.com/vi/29EN9Anic9Q/0.jpg",
    "link": "https://www.youtube.com/watch?v=29EN9Anic9Q"
  },
  {
    "title": "게임중독 상태‥전투 게임하듯 범행 조선 구속기소",
    "content": "This news segment reports on a deadly stabbing incident near Seoul's Sillim Station, where the suspect, a 33-year-old man, attacked multiple people in what prosecutors describe as behavior mimicking a first-person combat video game. They concluded the man was addicted to games, having spent eight months immersed in weapon-based gameplay and videos, which, coupled with personal frustrations and hatred toward his peers, contributed to the crime. While the report links video game addiction to the suspect’s mindset, it presents the event primarily as a case of irrational, hate-driven violence with deeper psychological and societal roots.",
    "image": "https://img.youtube.com/vi/IxGerTfztgA/0.jpg",
    "link": "https://www.youtube.com/watch?v=IxGerTfztgA"
  }
] 